Repository: learningequality/kolibri-installer-gnome
Catalog: po/*.po
Languages: it

source: Offline education technology platform
it: Piattaforma tecnologica per l'istruzione offline

source: education;multimedia;videos;learning;quiz;
it: istruzione;multimedia;video;apprendimento;quiz;

source: Offline learning platform
it: Piattaforma di apprendimento offline

source: Kolibri provides offline access to a curated and openly licensed educational content library, focused on serving both learners and educators.
it: Kolibri fornisce accesso offline a una libreria di contenuti educativi curata e con licenza aperta,incentrata sul servizio sia agli studenti che agli educatori.

source: Available in dozens of languages, the Kolibri Content Library includes both formal educational materials, such as lessons and assessments, as well as exploratory materials, such as books, games, and simulations.
it: Disponibile in decine di lingue, la Kolibri Content Library include sia materiali didattici formali, come lezioni e valutazioni, sia materiali esplorativi, come libri, giochi e simulazioni.

source: Browsing content in Kolibri
it: Esplorazione dei contenuti in Kolibri

source: Exploring more content in Kolibri
it: Esplora altri contenuti in Kolibri

source: Watching a video from Khan Academy using Kolibri
it: Guardare un video di Khan Academy utilizzando Kolibri

source: Changes included in this release:
it: Modifiche incluse in questa versione:

source: Kolibri has been updated to 0.17.2.
it: Kolibri è stato aggiornato alla versione 0.17.2.

source: The application runtime is updated to GNOME 47.
it: Il runtime dell'applicazione è stato aggiornato a GNOME 47.

source: An Italian translation has been added.
it: È stata aggiunta una traduzione in italiano.

source: Kolibri has been updated to 0.17.0.
it: Kolibri è stato aggiornato alla versione 0.17.0.

source: Kolibri has been updated to 0.16.2.
it: Kolibri è stato aggiornato alla versione 0.16.2.

source: The app icon has been updated.
it: L'icona dell'app è stata aggiornata.

source: The Kolibri app will now sign in automatically using credentials associated with the current desktop user account.
it: L'app Kolibri ora effettuerà l'accesso automaticamente utilizzando le credenziali associate all'account utente desktop corrente.

source: The main menu has been simplified.
it: Il menu principale è stato semplificato.

source: Troubleshooting information has been added to the About window.
it: Sono state aggiunte informazioni sulla risoluzione dei problemi alla finestra Informazioni.

source: Kolibri's first run setup wizard will appear in a dialog when the application is started for the first time.
it: La configurazione guidata di Kolibri apparirà in una finestra di dialogo quando l'applicazione viene avviata per la prima volta.

source: An issue was resolved where the application was failing to save files selected using the file chooser dialog.
it: È stato risolto un problema per cui l'applicazione non riusciva a salvare i file selezionati tramite la finestra di dialogo di selezione file.

source: Community Forums
it: Forum della comunità

source: Open Kolibri Home Folder
it: Apri cartella Home di Kolibri

source: Save File
it: Salva file

source: Main Menu
it: Menu pincipale

source: New Window
it: Nuova finestra

source: Reload
it: Ricarica

source: Actual Size
it: Dimensione attuale

source: Zoom In
it: Zoom avanti

source: Zoom Out
it: Zoom indietro

source: Open in Browser
it: Apri nel browser

source: Show Developer Tools
it: Mostra Strumenti per sviluppatori

source: Help
it: Aiuto

source: About
it: Informazioni
